// 2022-02-04 금

// ▶ 컬렉션 프레임워크(Collection Framework)

// 클래스, 객체, 인스턴스, 인터페이스와 더불어 정말 중요한 파트!

/*
○ 컬렉션 프레임워크(Collection Framework)
   = 컬렉션(Collection) + 프레임워크(Framework)
     ------------------   ---------------------
			  |	     	     환경, 틀, 약속
              |
          집합, 모음 → 수집품, 소장품, (물건? 사람들?의) 무리, 더미, 수집, 수거
		                --------------------------------------------------------
						            모아놓은 것들... 모여있는 것들
  
  ==>> 자료구조

  // 자료구조 알고리즘 공부 왕 많이 해야 함 왕왕왕 많이 많이

○ 자료
// 수집한 거
// 극장에 10명이 왔네 -> 자료
// 토요일에 사람이 많이 오는구나 -> 정보 --> 경영

// 자료 구조 -> (자료 성질 파악) -> 자료를 어디다 담지? --> 밀폐 용기에 담자
// 알고리즘 -> 어떤 방식으로 꺼내쓰고 참조하고 할지 원활하게 운용
*/
//-------------------------------------------------------------------------------------------------
public class Test156
{
	public static void main(String[] args)
	{
		
	}
}