// 20221011

// ▶실행 흐름의 컨트롤(제어문)

// if ~ else

//------------------------------------------------------------------
// ● 과제 ● 

// 사용자로부터 임의의 문자를 하나 입력받아
// 대문자이면 소문자로, 소문자이면 대문자로
// 알파벳이 아닌 기타 문자이면 그 문자 그대로 출력하는
// 프로그램을 구현한다.

// 실행 예)
// 한 문자 입력 : A
// >> A → a
// 계속하려면 아무 키나 누르십시오 . . .

// 한 문자 입력 : b
// >> b → B
// 계속하려면 아무 키나 누르십시오 . . .

// 한 문자 입력 : 7
// >> 입력 오류~!!!
// 계속하려면 아무 키나 누르십시오 . . .
//------------------------------------------------------------------

public class Test042
{
	public static void main(String[] args)
	{
		
	}
}