// 20221011

// ▶실행 흐름의 컨트롤(제어문)
//----------------------------------------------------------------------
// 반복문(while문) 실습

// 사용자로부터 임의의 정수를 입력받아
// 입력받은 정수가 소수인지 아닌지를 판별하여
// 결과를 출력하는 프로그램을 구현한다.

// ※ 소수 : 1 또는 자기 자신의 값 이외에 어떤 수로도 나누어 떨어지지 않는 수
//           단, 1은 소수가 아님.

// 실행 예)
// 임의의 정수 입력 : 10 
// 10 → 소수 아님
// 계속하려면 . . .

// 임의의 정수 입력 : 967 / 1~967까지 나눠보고? 마지막까지 소수 아니면 1인지 아닌지 판별

public class Test053
{
	public static void main(String[] args)
	{
		BufferedReader br = new BufferedReader(new InputStreamReader(System.in))
	}
}