// 20220118 화
// ▶배열
// 배열의 배열(2차원 배열)
//-------------------------------------------------------------------------------------------------
// 배열의 배열(다차원 배열)을 활용하여
// 다음과 같은 데이터를 요소로 취하는 배열을 구성하고
// 그 결과를 출력하는 프로그램을 구현한다.

// 실행 예)
/*
  1   2   3   4  10
  5   6   7   8  26
  9  10  11  12  42
 13  14  15  16  58
 28  32  36  40 136
계속하려면 . . .
//-------------------------------------------------------------------------------------------------
0,0 0,1 0,2 0,3 0,4  
1,0 1,1 1,2 1,3 1,4  
2,0 2,1 2,2 2,3 2,4  
3,0 3,1 3,2 3,3 3,4  
4,0 4,1 4,2 4,3 4,4 
*/
//-------------------------------------------------------------------------------------------------

public class Test093
{
	public static void main(String[] args)
	{
		int[][] arr = new int[5][5];
		
		int n = 0; 
		int sum = 0;
		
		/*
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++) 
			{
				sum += arr[i][j];

				if (j==4) // 5행이 되면
				{
					arr[i][4] += sum; // 각 행의 누적값
				}
				else if (i==4) // 5열이 되면
				{
					arr[4][j] += sum; // 각 열의 누적값
				}
				else
				{
					arr[i][j] = n;
					n++;
				}		
			}
		}
		*/
			
		for (int i=0; i<arr.length-1; i++)
		{
			for (int j=0; j<arr[i].length-1; j++) 
			{
				n++;	
				arr[i][j] = n;

				//sum += arr[i][j];
				
				arr[i][arr[i].length-1] += arr[i][j];
				arr[arr.length-1][j] += arr[i][j];
				arr[arr.length-1][arr[i].length-1] += arr[i][j];
				
				/*
				arr[i][4] += arr[i][j];
				arr[4][j] += arr[i][j];
				arr[4][4] += arr[i][j];
				*/
			}
		}	

		// 배열의 배열 요소 전체 출력
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++)
			{
				System.out.printf("%4d", arr[i][j]);
			}
			System.out.println();
		}
	}
}
// 실행 결과
/*
   1   2   3   4  10
   5   6   7   8  26
   9  10  11  12  42
  13  14  15  16  58
  28  32  36  40 136
계속하려면 아무 키나 누르십시오 . . .
*/