// 20220118 화
// ▶배열
// 배열의 배열(2차원 배열)

// 배열의 배열(다차원 배열)을 활용하여
// 다음과 같은 데이터를 요소로 취하는 배열을 구성하고
// 그 결과를 출력하는 프로그램을 구현한다.

// 실행 예)
/*
1  2  3  4  5  i=0  0,0 0,1 0,2 0,3 0,4  1= 0,0 1,1 2,2 3,3 4,4
5  1  2  3  4  i=1  1,0 1,1 1,2 1,3 1,4  2= 0,1 1,2 2,3 3,4 4,0
4  5  1  2  3  i=2  2,0 2,1 2,2 2,3 2,4  3= 0,2 1,3 2,4 3,0 4,1
3  4  5  1  2  i=3  3,0 3,1 3,2 3,3 3,4  4= 0,3 1,4 2,0 3,1 4,2
2  3  4  5  1  i=4  4,0 4,1 4,2 4,3 4,4  5= 0,4 1,0 2,1 3,2 4,3
계속하려면 . . .
*/

/*
1  2  3  4  5  i=0  0부터 출발
5  1  2  3  4  i=1  1부터 출발
4  5  1  2  3  i=2  2부터 출발
3  4  5  1  2  i=3  3부터 출발
2  3  4  5  1  i=4  4부터 출발
*/

/* 0
               0 으로...
1  2  3  4  5  |
   1  2  3  4  |  5
      1  2  3  |  4  5
         1  2  |  3  4  5
            1  |  2  3  4  5
*/

//-------------------------------------------------------------------------------------------------
public class Test090
{
	public static void main(String[] args)
	{
		
		int[][] arr = new int[5][5];

		int n = 1;

		for (int i=0; i<arr.length; i++) // 웅 ~
		{
			for (int j=i; j<arr.length; j++) // 쑝!
			{
				arr[i][j] = n;
			}
			//System.out.println();
		}
		
		
		// 수업 풀이

		// 배열의 배열 선언 및 메모리 할당
		/*
		int[][] arr = new int[5][5];

		for (int i=0; i<arr.length; i++)
		{
			for (int j=i, n=1; n<=5; n++) // n → 1 2 3 4 5
			{
				//System.out.print(i+"-"+j+" ");   //00→1 11→1 22→1 33→1 44→1
                                                   //01→2 12→2 23→2 34→2 40→2
				arr[i][j] = n;                     //02→3 13→3 24→3 30→3 41→3 
                                                   //03→4 14→4 20→4 31→4 42→4
				j++;                               //04→5 10→5 21→5 32→5 43→5

				if (j==5)
				{
					j=0;
				}
			}
			//System.out.println();
		}
		*/
		

		// 전체 출력
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++)
			{
				System.out.printf("%3d", arr[i][j]);
			}
			System.out.println();
		}
	}
}