// 20220118 화
// ▶배열
// 배열의 배열(2차원 배열)
//-------------------------------------------------------------------------------------------------
// 배열의 배열(다차원 배열)을 활용하여
// 다음과 같은 데이터를 요소로 취하는 배열을 구성하고
// 그 결과를 출력하는 프로그램을 구현한다.

// 실행 예)
/*
1  8  9 16 17     1  5  9 13 17     
2  7 10 15 18     2  6 10 14 18
3  6 11 14 19     3  7 11 15 19 
4  5 12 13 20     4  8 12 16 20
계속하려면 . . .
*/

//      0  0  0  0    0  0  0  0    0  0  0  0    0  0  0  0    0  0  0  0
// 웅~  i  i  i  i    i  i  i  i    i  i  i  i    i  i  i  i    i  i  i  i
//     00 10 20 30   31 21 11 01   02 12 22 32   33 23 13 03   04 14 24 34
// 쑝~ j  j  j  j    j  j  j  j    j  j  j  j    j  j  j  j    j  j  j  j
//     0  1  2  3    3  1  2  0    0  1  2  3    3  1  2  0    0  1  2  3
//-------------------------------------------------------------------------------------------------
public class Test091
{
	public static void main(String[] args)
	{
		/*
		int[][] arr = new int[4][5];

		int n = 1;
		*/
		
		// 순차 출력
		/*
		for (int i=0; i<arr.length; i++) // 웅 ~
		{
			for (int j=0; j<arr[i].length; j++) // 쑝!
			{
				arr[i][j] = n;
				n++;
			}
		}
		*/
		/*
		  1  2  3  4  5
		  6  7  8  9 10
		 11 12 13 14 15
		 16 17 18 19 20
		*/

		// 지그재그
		/*
		for (int i=0; i<arr.length; i++) // 웅 ~
		{
			n=1+i;

			for (int j=0; j<arr[i].length; j++) // 쑝!
			{
				arr[i][j] = n;
				n+=4;
			}
		}
		*/
		/*
		  1  5  9 13 17
		  2  6 10 14 18
		  3  7 11 15 19
		  4  8 12 16 20
		*/
		/*
		for (int i=0; i<arr.length; i++) // 웅 ~
		{
			n=1+i;

			for (int j=0; j<arr[i].length; j++) // 쑝!
			{
				arr[i][j] = n;
				n+=4;
				if (j==1 || j==3)
				{
					
				}
			}
		}
		*/

		// 수업 풀이

		int[][] arr = new int[4][5];

		int n=0;

		for (int i=0; i<5; i++)     // outer 웅 i → 0 1 2 3 4
		{
			for (int j=0; j<4; j++) // inner 쑝 j → 0 1 2 3 
			{
				//arr[j][i]
				//System.out.print(j + "" + i + " ");

				n++;

				if (i%2==0)          // i → 0 2 4
				{
					arr[j][i] = n;
				}
				else                 // i → 1 3
				{                    // 0 1 2 3을 3 2 1 0으로...
					arr[3-j][i] = n; // [3-0][1]  [3-0][3]
				}                    // [3-1][1]  [3-1][3]
			}                        // [3-2][1]  [3-2][3]
			                         // [3-3][1]  [3-3][3]
			//System.out.println();
		}
		
		// 전체 출력
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++)
			{
				System.out.printf("%3d", arr[i][j]);
			}
			System.out.println();
		}
	}
}
// 실행 결과
/*
  1  8  9 16 17
  2  7 10 15 18
  3  6 11 14 19
  4  5 12 13 20
계속하려면 아무 키나 누르십시오 . . .
*/